driver-tests/bpelse/misc/MiscJbi/test/WebService_Invoke/Input.xml

<soap:Envelope
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:tns="http://stc.com/ParentProcess"
xmlns:xs="http://www.w3.org/2001/XMLSchema">
<soap:Body>
<tns:SimpleObject>
<tns:number>6</tns:number>
</tns:SimpleObject>
</soap:Body>
</soap:Envelope>